000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. NOCOPY.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005     COPY NOSUCHBOOK.
000006 01  WS-A                    PIC X.
000007 PROCEDURE DIVISION.
000008 MAIN-PARA.
000009     STOP RUN.
