000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. REPLDEMO.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005 REPLACE ==OLD-NAME== BY ==NEW-NAME==.
000006 01  OLD-NAME                PIC X(4).
000007 REPLACE OFF.
000008 01  OLD-KEPT                PIC X(4).
000009 PROCEDURE DIVISION.
000010 MAIN-PARA.
000011     COPY LOOPA.
000012     STOP RUN.
