 DEFINE TRANSACTION(INV1) GROUP(BILLING)
        PROGRAM(INVONL)
 DEFINE TRANSACTION(CUS1) GROUP(BILLING)
        PROGRAM(CUSTUPD)
 DEFINE FILE(CUSTFIL) GROUP(BILLING)
        DSNAME(BILL.CUST.MASTER)
