000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. MENU.
000003*SYNTHETIC MENU THAT DISPATCHES THROUGH A TABLE AND A CONSTANT
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01  MENU-OPTIONS.
000007     05  MENU-DATA.
000008         10  FILLER          PIC X(08) VALUE 'BATCH1'.
000009         10  FILLER          PIC X(02) VALUE 'AB'.
000010         10  FILLER          PIC X(08) VALUE 'SUBPGM'.
000011         10  FILLER          PIC X(02) VALUE 'CD'.
000012     05  MENU-TABLE REDEFINES MENU-DATA.
000013         10  MENU-OPT OCCURS 2 TIMES.
000014             15  MENU-PGM    PIC X(08).
000015             15  MENU-CODE   PIC X(02).
000016 01  WS-OPTION               PIC 9.
000017 01  LIT-BACK                PIC X(08) VALUE 'FLOWS'.
000018 01  WS-TO-PGM               PIC X(08).
000019 PROCEDURE DIVISION.
000020 MAIN-PARA.
000021     EXEC CICS XCTL PROGRAM(MENU-PGM(WS-OPTION)) END-EXEC
000022     MOVE LIT-BACK TO WS-TO-PGM
000023     EXEC CICS XCTL PROGRAM(WS-TO-PGM) END-EXEC
000024     GOBACK.
