000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. SUBPGM.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005 01  WS-X                    PIC X.
000006 LINKAGE SECTION.
000007 01  LK-COUNT                PIC 9(5).
000008 PROCEDURE DIVISION USING LK-COUNT.
000009 MAIN-PARA.
000010     EXEC CICS XCTL PROGRAM('BATCH1') END-EXEC
000011     EXEC CICS READ DATASET('ACCTDAT') INTO(WS-X)
000012          RIDFLD(LK-COUNT) END-EXEC
000013     CALL 'CSNBOWH' USING WS-X
000014     EXEC CICS SEND MAP('SUBSCR') MAPSET('SUBMAP') END-EXEC
000015     EXEC CICS RETURN TRANSID('TB01') END-EXEC
000016     GOBACK.
