 DEFINE FILE(ACCTDAT) GROUP(TESTGRP)
        DSNAME(TEST.ACCT.DATA) RECORDFORMAT(F) STATUS(ENABLED)
 DEFINE TRANSACTION(TB01) GROUP(TESTGRP)
        PROGRAM(SUBPGM) TWASIZE(0) PROFILE(DFHCICST)
 DEFINE MAPSET(SUBMAP) GROUP(TESTGRP)
        DESCRIPTION(SUBPGM SCREEN)
