000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. INVSIGN.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005 01  WS-RC                   PIC S9(8) COMP.
000006 LINKAGE SECTION.
000007 01  LK-LINE                 PIC X(80).
000008 PROCEDURE DIVISION USING LK-LINE.
000009 SIGN-PARA.
000010     CALL 'CSNDDSG' USING WS-RC LK-LINE
000011     GOBACK.
